#### 📖 Terraform Plan ('infra/resources/dev') - success
<details>
<summary>Terraform Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_api_management_named_value.to_do_api_key_v3 will be created
  + resource "azurerm_api_management_named_value" "to_do_api_key_v3" {
      + api_management_name = "dx-d-itn-playground-pg-apim-01"
      + display_name        = "to-do-api-function-key-v3"
      + id                  = (known after apply)
      + name                = "to-do-api-function-key-v3"
      + resource_group_name = "dx-d-itn-test-rg-01"
      + secret              = true

      + value_from_key_vault {
          + secret_id = "https://dx-d-itn-common-kv-01.vault.azure.net/secrets/to-do-api-key-func-v3"
        }
    }

  # module.apim.azurerm_api_management_diagnostic.applicationinsights[0] will be updated in-place
  ~ resource "azurerm_api_management_diagnostic" "applicationinsights" {
      ~ api_management_logger_id  = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.ApiManagement/service/dx-d-itn-playground-pg-apim-01/loggers/dx-d-itn-playground-pg-apim-01-logger" -> (known after apply)
        id                        = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.ApiManagement/service/dx-d-itn-playground-pg-apim-01/diagnostics/applicationinsights"
        # (9 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.apim.azurerm_api_management_logger.this[0] must be replaced
-/+ resource "azurerm_api_management_logger" "this" {
      ~ id                  = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.ApiManagement/service/dx-d-itn-playground-pg-apim-01/loggers/dx-d-itn-playground-pg-apim-01-logger" -> (known after apply)
        name                = "dx-d-itn-playground-pg-apim-01-logger"
      ~ resource_id         = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.Insights/components/dx-d-itn-playground-to-do-api-appi-01" -> "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.Insights/components/dx-d-itn-playground-azure-function-v3-appi-01" # forces replacement
        # (4 unchanged attributes hidden)

      ~ application_insights {
          ~ connection_string   = (sensitive value)
            # (1 unchanged attribute hidden)
        }
    }

  # module.apim.azurerm_monitor_diagnostic_setting.apim[0] will be updated in-place
  ~ resource "azurerm_monitor_diagnostic_setting" "apim" {
        id                             = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.ApiManagement/service/dx-d-itn-playground-pg-apim-01|dx-d-itn-playground-pg-apim-01-diagnostic"
      ~ log_analytics_workspace_id     = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.OperationalInsights/workspaces/dx-d-itn-playground-to-do-api-log-01" -> "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.OperationalInsights/workspaces/dx-d-itn-playground-azure-function-v3-log-01"
        name                           = "dx-d-itn-playground-pg-apim-01-diagnostic"
        # (4 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.app_service.azurerm_linux_web_app.this will be updated in-place
  ~ resource "azurerm_linux_web_app" "this" {
      ~ app_settings                                   = {
          ~ "APPLICATIONINSIGHTS_CONNECTION_STRING"           = (sensitive value)
            # (11 unchanged elements hidden)
        }
        id                                             = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.Web/sites/dx-d-itn-playground-fe-app-01"
        name                                           = "dx-d-itn-playground-fe-app-01"
        tags                                           = {
            "BusinessUnit"                                   = "DevEx"
            "CostCenter"                                     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Dev"
            "ManagementTeam"                                 = "Developer Experience"
            "ModuleName"                                     = "azure_app_service"
            "ModuleSource"                                   = "DX"
            "ModuleVersion"                                  = "1.0.0"
            "Scope"                                          = "Dynatrace PoC"
            "Source"                                         = "https://github.com/pagopa/dx-playground/tree/main/infra/repository"
        }
        # (25 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.function_app.azurerm_linux_function_app.this will be updated in-place
  ~ resource "azurerm_linux_function_app" "this" {
        id                                             = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.Web/sites/dx-d-itn-playground-be-func-01"
        name                                           = "dx-d-itn-playground-be-func-01"
        tags                                           = {
            "BusinessUnit"                                   = "DevEx"
            "CostCenter"                                     = "TS000 - Tecnologia e Servizi"
            "CreatedBy"                                      = "Terraform"
            "Environment"                                    = "Dev"
            "ManagementTeam"                                 = "Developer Experience"
            "ModuleName"                                     = "azure_function_app"
            "ModuleSource"                                   = "DX"
            "ModuleVersion"                                  = "1.0.0"
            "Scope"                                          = "Dynatrace PoC"
            "Source"                                         = "https://github.com/pagopa/dx-playground/tree/main/infra/repository"
        }
        # (34 unchanged attributes hidden)

      ~ site_config {
          ~ application_insights_connection_string        = (sensitive value)
            # (32 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }

        # (2 unchanged blocks hidden)
    }

  # module.to_do_api.azurerm_api_management_api_policy.policy will be updated in-place
  ~ resource "azurerm_api_management_api_policy" "policy" {
        id                  = "/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.ApiManagement/service/dx-d-itn-playground-pg-apim-01/apis/to-do-api"
      ~ xml_content         = <<-EOT
          - <policies>
          - 	<inbound>
          - 		<base />
          - 		<set-backend-service backend-id="to-do-api-azure-function" />
          - 		<!-- Append base-path, if defined, before invoking the backend -->
          - 		<choose>
          - 			<when condition="@(System.String.IsNullOrEmpty("api"))"></when>
          - 			<otherwise>
          - 				<rewrite-uri template="@(System.String.Concat("api/", context.Request.Url.Path))" />
          - 			</otherwise>
          - 		</choose>
          - 		<cors>
          - 			<allowed-origins>
          - 				<origin>*</origin>
          - 			</allowed-origins>
          - 			<allowed-methods>
          - 				<method>*</method>
          - 			</allowed-methods>
          - 			<allowed-headers>
          - 				<header>*</header>
          - 			</allowed-headers>
          - 			<expose-headers>
          - 				<header>*</header>
          - 			</expose-headers>
          - 		</cors>
          - 	</inbound>
          - 	<outbound>
          - 		<base />
          - 	</outbound>
          - 	<backend>
          - 		<base />
          - 	</backend>
          - 	<on-error>
          - 		<base />
          - 	</on-error>
          + <policies>
          +   <inbound>
          +     <base />
          +     <set-backend-service backend-id="to-do-api-azure-function" />
          + 
          +      <!-- Append base-path, if defined, before invoking the backend -->
          +     <choose>
          +       <when condition='@(System.String.IsNullOrEmpty("api"))'>
          +       </when>
          +       <otherwise>
          +         <rewrite-uri template='@(System.String.Concat("api/", context.Request.Url.Path))' />
          +       </otherwise>
          +     </choose>
          + 
          +     <cors>
          +       <allowed-origins>
          +           <origin>*</origin>
          +       </allowed-origins>
          +       <allowed-methods>
          +           <method>*</method>
          +       </allowed-methods>
          +       <allowed-headers>
          +           <header>*</header>
          +       </allowed-headers>
          +       <expose-headers>
          +           <header>*</header>
          +       </expose-headers>
          +     </cors>
          +   </inbound>
          +   <outbound>
          +     <base />
          +   </outbound>
          +   <backend>
          +     <base />
          +   </backend>
          +   <on-error>
          +     <base />
          +   </on-error>
            </policies>
        EOT
        # (4 unchanged attributes hidden)
    }

  # module.to_do_api_v3.azurerm_api_management_api.api will be created
  + resource "azurerm_api_management_api" "api" {
      + api_management_name   = "dx-d-itn-playground-pg-apim-01"
      + api_type              = (known after apply)
      + description           = "API to handle a To Do list - Function V3"
      + display_name          = "To Do API - V3"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "to-do-api-v3"
      + path                  = "todo"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "dx-d-itn-test-rg-01"
      + revision              = "1"
      + service_url           = (known after apply)
      + subscription_required = true
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi"
          + content_value  = <<-EOT
                openapi: 3.0.3
                info:
                  title: To Do List API
                  version: 0.0.0
                
                security:
                  - ApiKeyAuth: []
                
                paths:
                
                  /info:
                    get:
                      operationId: info
                      responses:
                        '200':
                          description: Success
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ApplicationInfo'
                        '500':
                          description: Internal Server error
                
                  /tasks:
                    post:
                      operationId: createTask
                      summary: Create a new task
                      requestBody:
                        content:
                          application/json:
                            schema:
                              $ref: '#/components/schemas/CreateTaskItem'
                      responses:
                        '201':
                          description: Returns the created task
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/TaskItem'
                        '400':
                          description: Invalid request body
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ProblemJSON'
                        '500':
                          description: Internal server error
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ProblemJSON'
                    get:
                      operationId: listTasks
                      summary: List tasks
                      responses:
                        '200':
                          description: Returns a list of tasks.
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/TaskItemList'
                        '500':
                          description: Internal server error
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ProblemJSON'
                
                  /tasks/{taskId}:
                    get:
                      description: Get information of a task
                      summary: Get a task
                      operationId: getTaskById
                      parameters:
                        - in: path
                          name: taskId
                          schema:
                            type: string
                          required: true
                          description: The id of the task
                      responses:
                        '200':
                          description: Details of the task
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/TaskItem'
                        '404':
                          description: Task not found
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ProblemJSON'
                        '500':
                          description: Internal server error
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ProblemJSON'
                    delete:
                      description: Delete a task
                      summary: Delete a task
                      operationId: deleteTask
                      parameters:
                        - in: path
                          name: taskId
                          schema:
                            type: string
                          required: true
                          description: The id of the task
                      responses:
                        '204':
                          description: Task deleted
                        '404':
                          description: Task not found
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ProblemJSON'
                        '500':
                          description: Internal server error
                          content:
                            application/json:
                              schema:
                                $ref: '#/components/schemas/ProblemJSON'
                
                components:
                  securitySchemes:
                    ApiKeyAuth:
                      type: apiKey
                      in: header
                      name: Ocp-Apim-Subscription-Key
                  schemas:
                    ApplicationInfo:
                      type: object
                      properties:
                        name:
                          type: string
                        version:
                          type: string
                      required:
                        - name
                        - version
                    CreateTaskItem:
                      type: object
                      required:
                        - title
                      properties:
                        title:
                          $ref: '#/components/schemas/TaskTitle'
                    TaskId:
                      description: The id of the task
                      type: string
                    TaskTitle:
                      description: The title of the task
                      type: string
                    TaskState:
                      type: string
                      description: |-
                        - COMPLETED: The task has been completed
                        - INCOMPLETE: The task is not yet completed
                        - DELETED: The task has been marked as deleted
                      x-extensible-enum:
                        - COMPLETED
                        - INCOMPLETE
                        - DELETED
                    TaskItem:
                      type: object
                      required:
                        - id
                        - title
                        - state
                      properties:
                        id:
                          $ref: '#/components/schemas/TaskId'
                        title:
                          $ref: '#/components/schemas/TaskTitle'
                        state:
                          $ref: '#/components/schemas/TaskState'
                    TaskItemList:
                      type: array
                      items:
                        $ref: '#/components/schemas/TaskItem'
                    ProblemJSON:
                      type: object
                      required:
                        - status
                        - message
                      properties:
                        status:
                          type: number
                          description: The HTTP status code
                        message:
                          type: string
                          description: The description of the error
            EOT
        }

      + subscription_key_parameter_names (known after apply)
    }

  # module.to_do_api_v3.azurerm_api_management_api_policy.policy will be created
  + resource "azurerm_api_management_api_policy" "policy" {
      + api_management_name = "dx-d-itn-playground-pg-apim-01"
      + api_name            = "to-do-api-v3"
      + id                  = (known after apply)
      + resource_group_name = "dx-d-itn-test-rg-01"
      + xml_content         = <<-EOT
            <policies>
              <inbound>
                <base />
                <set-backend-service backend-id="to-do-api-azure-function" />
            
                 <!-- Append base-path, if defined, before invoking the backend -->
                <choose>
                  <when condition='@(System.String.IsNullOrEmpty("api"))'>
                  </when>
                  <otherwise>
                    <rewrite-uri template='@(System.String.Concat("api/", context.Request.Url.Path))' />
                  </otherwise>
                </choose>
            
                <cors>
                  <allowed-origins>
                      <origin>*</origin>
                  </allowed-origins>
                  <allowed-methods>
                      <method>*</method>
                  </allowed-methods>
                  <allowed-headers>
                      <header>*</header>
                  </allowed-headers>
                  <expose-headers>
                      <header>*</header>
                  </expose-headers>
                </cors>
              </inbound>
              <outbound>
                <base />
              </outbound>
              <backend>
                <base />
              </backend>
              <on-error>
                <base />
              </on-error>
            </policies>
        EOT
    }

  # module.to_do_api_v3.azurerm_api_management_backend.backend will be created
  + resource "azurerm_api_management_backend" "backend" {
      + api_management_name = "dx-d-itn-playground-pg-apim-01"
      + description         = "API to handle a To Do list - Function V3"
      + id                  = (known after apply)
      + name                = "to-do-api-azure-function"
      + protocol            = "http"
      + resource_group_name = "dx-d-itn-test-rg-01"
      + resource_id         = "https://management.azure.com/subscriptions/d7de83e0-0571-40ad-b63a-64c942385eae/resourceGroups/dx-d-itn-test-rg-01/providers/Microsoft.Web/sites/dx-d-itn-playground-v3-func-01"
      + url                 = "https://dx-d-itn-playground-v3-func-01.azurewebsites.net"

      + credentials {
          + header = {
              + "x-functions-key" = "{{to-do-api-function-key-v3}}"
            }
        }
    }

Plan: 5 to add, 5 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
